# Pandas DataFrame insert colum

In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({"First":[1,2], "Second":[3,4]})

In [3]:
data

   First  Second
0      1       3
1      2       4

In [4]:
data.insert(2, "Third",[5,6]) # 2 is location, "Third" is column name, [5,6] is the value

In [5]:
data

   First  Second  Third
0      1       3      5
1      2       4      6

In [6]:
data.insert(0, "First",[0,1])

ValueError: cannot insert First, already exists

In [7]:
# To allow duplicates of same value of location and same column name

In [8]:
data.insert(0, "First",[0,1], allow_duplicates=True)

In [9]:
data

   First  First  Second  Third
0      0      1       3      5
1      1      2       4      6